# 2. DataFrame
# 2차원 데이터 (Series 들의 모음)
# (dictionary) 자료구조를 통해 생성
# 데이터 접근
import pandas as pd

data = {
    '이름' : ['강나래', '강태원', '강호림', '김수찬', '김재욱', '박동현', '박혜정', '승근열'],
    '학교' : ['구로고', '구로고', '구로고', '구로고', '구로고', '디지털고', '디지털고', '디지털고'],
    '키' : [197, 184, 168, 187, 188, 202, 188, 190],
    '국어' : [90, 40, 80, 40, 15, 80, 55, 100],
    '영어' : [85, 35, 75, 60, 20, 100, 65, 85],
    '수학' : [100, 50, 70, 70, 10, 95, 45, 90],
    '과학' : [95, 55, 80, 75, 35, 85, 40, 95],
    '사회' : [85, 25, 75, 80, 10, 80, 35, 95],
    'SW특기' : ['Python', 'Java', 'Javascript', '', '', 'C', 'PYTHON', 'C#']
}

df = pd.DataFrame(data)
print(df)
print(type(df))


# dictionary에서 DataFrame 객체 생성해서 설정
df = pd.DataFrame(data)
print(df)


# 데이터 접근
print(df['이름'])         # 이름 컬럼 출력
print(df['키'])            # 키 컬럼 출력
print(df[['이름', '키']])  # 이름, 키 컬럼 출력
print(df[['이름','키','SW특기']]) # 3개 컬럼 출력
