import pandas as pd
#2차원 데이터
data = {
    '이름' : ['채치수', '정대만', '송태섭', '서태웅', '강백호', '변덕규', '황태산', '윤대협'],
    '학교' : ['북산고', '북산고', '북산고', '북산고', '북산고', '능남고', '능남고', '능남고'],
    '키' : [197, 184, 168, 187, 188, 202, 188, 190],
    '국어' : [90, 40, 80, 40, 15, 80, 55, 100],
    '영어' : [85, 35, 75, 60, 20, 100, 65, 85],
    '수학' : [100, 50, 70, 70, 10, 95, 45, 90],
    '과학' : [95, 55, 80, 75, 35, 85, 40, 95],
    '사회' : [85, 25, 75, 80, 10, 80, 35, 95],
    'SW특기' : ['Python', 'Java', 'Javascript', '', '', 'C', 'PYTHON', 'C#']
}
print(data)
print(type(data))


df=pd.DataFrame(data)
print(df)

print(df['이름']) #1개 컬럼 가져올때

print(df[['이름','키']]) #2개 컬럼 가져올때 [[ ]] 2개해야 함.

df.index.name='지원번호'
print(df)

# df.to_csv('score.csv',encoding='utf-8-sig')
# df.to_csv('score.txt')
# df.to_excel('score.xlsx')
